<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>All is well | Learn &amp; Cope</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/3.0.3/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/2.2.1/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">All is well</h1><a id="logo" href="/.">All is well</a><p class="description">Learn &amp; Cope</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/tools/"><i class="fa fa-cog"> 工具</i></a><a href="/future/"><i class="fa fa-heart"> 未来</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h2 class="post-title"><a href="/2017/06/03/yangguangcanlan/">在这阳光灿烂的日子里</a></h2><div class="post-meta">2017-06-03</div><a data-disqus-identifier="2017/06/03/yangguangcanlan/" href="/2017/06/03/yangguangcanlan/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x5199;&#x5B8C;&#x5C0F;&#x8BBA;&#x6587;&#x521D;&#x7A3F;&#xFF0C;&#x5F00;&#x5FC3;&#x7684;&#x4E0D;&#x884C;&#xFF0C;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x60F3;&#x627E;&#x4E2A;&#x4EBA;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x800C;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x54E6;&#xFF0C;&#x60F3;&#x60F3;&#x670B;&#x53CB;&#x4EEC;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x6837;&#x829D;&#x9EBB;&#x8C37;&#x5B50;&#x7684;&#x4E8B;&#x60C5;&#x600E;&#x4E48;&#x597D;&#x53E8;&#x6270;&#x4ED6;&#x4EEC;&#xFF0C;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x90A3;&#x4E2A;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x6BEB;&#x65E0;&#x987E;&#x5FCC;&#x5206;&#x4EAB;&#x4E00;&#x5207;&#x7684;&#x4EBA;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x5728;&#x6211;&#x8EAB;&#x8FB9;&#x4E86;~<br>&#x2003;&#x2003;&#x627E;&#x5B9E;&#x4E60;&#x3001;&#x60F3;&#x5DE5;&#x4F5C;&#x3001;&#x60F3;&#x57CE;&#x5E02;&#x3001;&#x60F3;&#x672A;&#x6765;&#xFF0C;&#x77ED;&#x77ED;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F3C;&#x4E4E;&#x6211;&#x7684;&#x672A;&#x6765;&#x5C31;&#x5728;&#x8FD9;&#x671F;&#x95F4;&#x88AB;&#x6162;&#x6162;&#x89C4;&#x5212;&#x51FA;&#x6765;&#x3002;&#x66FE;&#x7ECF;&#x542C;&#x8001;&#x5E08;&#x8BB2;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x8BDD;&#xFF08;&#x5927;&#x610F;&#xFF09;&#xFF1A;&#x5BF9;&#x4E8E;&#x672A;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E8E;&#x6211;&#x4EEC;&#x5927;&#x4F53;&#x6709;&#x4E09;&#x7C7B;&#x6807;&#x7B7E;&#xFF0C;&#x60F3;&#x505A;&#x7684;&#x3001;&#x80FD;&#x505A;&#x7684;&#x3001;&#x64C5;&#x957F;&#x505A;&#x7684;&#x3002;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x9009;&#x62E9;&#x7684;&#x5DE5;&#x4F5C;&#x5F80;&#x5F80;&#x53EA;&#x80FD;&#x5177;&#x5907;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x80FD;&#x591F;&#x62E5;&#x6709;&#x4E09;&#x4EFD;&#x6807;&#x7B7E;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x5E78;&#x798F;&#x6765;&#x5F62;&#x5BB9;&#x5427;&#x3002;&#x505A;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x5F88;&#x64C5;&#x957F;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x80FD;&#x83B7;&#x5F97;&#x76F8;&#x5E94;&#x7684;&#x7269;&#x8D28;&#x4E0E;&#x7CBE;&#x795E;&#x6536;&#x76CA;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6700;&#x8FD1;&#x770B;&#x4E86;&#x4E00;&#x90E8;&#x65E5;&#x5267;&#x300A;&#x56DB;&#x91CD;&#x594F;&#x300B;&#xFF08;&#x672C;&#x4EBA;&#x770B;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x65E5;&#x5267;&#xFF0C;&#x670B;&#x53CB;&#x63A8;&#x8350;&#xFF0C;&#x786E;&#x5B9E;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#xFF09;&#xFF0C;&#x56DB;&#x4E2A;&#x5FD7;&#x540C;&#x9053;&#x5408;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x60F3;&#x901A;&#x8FC7;&#x56DB;&#x91CD;&#x594F;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x97F3;&#x4E50;&#x68A6;&#x60F3;&#xFF0C;&#x7136;&#x800C;&#x73B0;&#x5B9E;&#x53C8;&#x4F3C;&#x4E4E;&#x4E0D;&#x5BB9;&#x8BB8;&#x4ED6;&#x4EEC;&#x5982;&#x6B64;&#x201C;&#x9A84;&#x7EB5;&#x201D;&#x81EA;&#x5DF1;&#xFF0C;&#x505A;&#x97F3;&#x4E50;&#x7684;&#x6536;&#x5165;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x8FD9;&#x79CD;&#x504F;&#x79BB;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x8F68;&#x9053;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x65E2;&#x8BA9;&#x4EBA;&#x5411;&#x5F80;&#xFF0C;&#x53C8;&#x8BA9;&#x4EBA;&#x65E0;&#x5948;&#x3002;&#x90A3;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x5462;&#xFF0C;&#x4E0A;&#x5B66;-&#x5DE5;&#x4F5C;-&#x7ED3;&#x5A5A;-&#x751F;&#x5B50;&#xFF0C;&#x5728;&#x4EC0;&#x4E48;&#x5E74;&#x7EAA;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x96BE;&#x9053;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x4E48;&#xFF0C;&#x800C;&#x4E14;&#x4EC0;&#x4E48;&#x53C8;&#x662F;&#x201C;&#x5E94;&#x8BE5;&#x201D;&#x5462;&#xFF1F;&#x7279;&#x522B;&#x559C;&#x6B22;&#x5267;&#x4E2D;&#x5C0F;&#x96C0;&#x5E38;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x71E5;&#x8D77;&#x6765;&#x4E86;~&#xFF08;&#x5979;&#x6BCF;&#x6B21;&#x8868;&#x6F14;&#x524D;&#x90FD;&#x4F1A;&#x5F88;&#x5174;&#x594B;&#xFF0C;&#x8BF4;&#x8FD9;&#x53E5;&#x8BDD;&#xFF09;&#xFF0C;&#x751F;&#x6D3B;&#x4E2D;&#x5982;&#x679C;&#x80FD;&#x5145;&#x6EE1;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x201C;&#x71E5;&#x8D77;&#x6765;&#x201D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x5F00;&#x5FC3;&#x3002;<br>&#x2003;&#x2003;&#x60F3;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x8FD9;&#x4E2A;&#x6CA1;&#x60F3;&#x6CD5;&#x7684;&#x4EBA;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x5E38;&#x5E38;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x95EE;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x5DE5;&#x4F5C;&#xFF0C;&#x53BB;&#x5927;&#x57CE;&#x5E02;&#x8FD8;&#x662F;&#x5C0F;&#x57CE;&#x5E02;&#xFF1F;&#x4E3A;&#x6B64;&#x6211;&#x4E5F;&#x66FE;&#x95EE;&#x8FC7;&#x597D;&#x591A;&#x524D;&#x8F88;&#xFF0C;&#x6700;&#x7EC8;&#x6709;&#x4E00;&#x70B9;&#x660E;&#x786E;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x5982;&#x679C;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x671F;&#x8BB8;&#xFF0C;&#x90A3;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x5E78;&#x798F;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x65E0;&#x6240;&#x8C13;&#x597D;&#x4E0E;&#x574F;&#xFF0C;&#x751F;&#x6D3B;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E8E;&#x5DF1;&#x3002;&#x81EA;&#x8EAB;&#x7EB5;&#x5411;&#x7684;&#x6BD4;&#x8F83;&#x53EF;&#x4EE5;&#x7ED9;&#x4E88;&#x81EA;&#x5DF1;&#x66F4;&#x591A;&#x81EA;&#x4FE1;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7B11;&#x7684;&#x591A;&#x4E00;&#x4E9B;&#x3002;&#x800C;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x6A2A;&#x5411;&#x6BD4;&#x8F83;&#x4E5F;&#x540C;&#x6837;&#x662F;&#x4E0D;&#x53EF;&#x7F3A;&#x5C11;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6BD5;&#x7ADF;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0E;&#x4EBA;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x770B;&#x770B;&#x5916;&#x8FB9;&#x7684;&#x4E16;&#x754C;&#x662F;&#x600E;&#x6837;&#xFF0C;&#x522B;&#x4EBA;&#x662F;&#x600E;&#x4E48;&#x751F;&#x6D3B;&#x7684;&#x3002;&#x65E0;&#x6240;&#x8C13;&#x597D;&#x574F;&#xFF0C;&#x4F46;&#x5F88;&#x8010;&#x4EBA;&#x5BFB;&#x5473;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#xFF1A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E0D;&#x77E5;&#x9053;&#x3002;<br>&#x2003;&#x2003;&#x524D;&#x4E24;&#x5929;&#x627E;&#x8001;&#x5E08;&#x804A;&#x5B9E;&#x4E60;&#x9009;&#x62E9;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#x6211;&#x7684;&#x4E24;&#x4E2A;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#x6709;&#x7740;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x4E00;&#x4E2A;&#x8001;&#x5E08;&#x5EFA;&#x8BAE;&#x6211;&#xFF0C;&#x5E74;&#x8F7B;&#x4EBA;&#x5C31;&#x5E94;&#x8BE5;&#x653E;&#x5F00;&#x4E00;&#x4E9B;&#xFF0C;&#x505A;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x4E0D;&#x8981;&#x6709;&#x4EC0;&#x4E48;&#x5305;&#x88B1;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x5219;&#x66F4;&#x52A0;&#x73B0;&#x5B9E;&#x4E00;&#x4E9B;&#xFF0C;&#x5B9E;&#x4E60;&#x7684;&#x9009;&#x62E9;&#x65E0;&#x5916;&#x4E4E;&#x5C31;&#x662F;&#x5C1D;&#x8BD5;&#x505A;&#x6700;&#x4F18;&#x9009;&#x62E9;&#xFF0C;&#x65E2;&#x7136;&#x662F;&#x9009;&#x62E9;&#xFF0C;&#x90A3;&#x53EF;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x5236;&#x5B9A;&#x4E00;&#x4E9B;&#x6807;&#x51C6;&#xFF08;&#x57CE;&#x5E02;&#x3001;&#x5DE5;&#x4F5C;&#x72B6;&#x6001;&#x3001;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x3001;&#x94B1;&#x7B49;&#xFF09;&#xFF0C;&#x6BCF;&#x79CD;&#x6807;&#x51C6;&#x90FD;&#x6709;&#x6743;&#x91CD;&#xFF0C;&#x90A3;&#x8FD9;&#x6837;&#x5C31;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x52A0;&#x6743;&#x6C42;&#x6700;&#x5927;&#x503C;&#x561B;&#xFF08;&#x771F;&#x662F;&#x53D7;&#x4E0D;&#x4E86;&#x4F60;&#x4EEC;&#x7406;&#x5DE5;&#x7537;&#x4E86;&#xFF0C;&#x52A8;&#x4E0D;&#x52A8;&#x5C31;&#x6765;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF09;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x89C2;&#x70B9;&#x65E0;&#x5173;&#x5BF9;&#x9519;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x6001;&#x5EA6;&#x800C;&#x5DF2;&#x3002;&#x771F;&#x662F;&#x53C8;&#x6298;&#x78E8;&#x4E86;&#x6211;&#x597D;&#x4E45;&#xFF0C;&#x6700;&#x7EC8;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x6CA1;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x201C;&#x653E;&#x7EB5;&#x201D;&#x4E00;&#x56DE;&#xFF0C;&#x73B0;&#x5B9E;&#x7684;&#x6743;&#x91CD;&#x4E8E;&#x6211;&#xFF08;&#x53EA;&#x81F3;&#x5C11;&#x662F;&#x76EE;&#x524D;&#x72B6;&#x6001;&#x7684;&#x6211;&#xFF09;&#x8FD8;&#x662F;&#x592A;&#x5927;&#x3002;<br>&#x2003;&#x2003;&#x8BB2;&#x70B9;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x5427;&#xFF0C;&#x5E74;&#x540E;&#x51E0;&#x4E2A;&#x6708;&#x6765;&#xFF0C;&#x81EA;&#x5DF1;&#x7626;&#x4E86;5&#x3001;6&#x65A4;&#xFF0C;&#x809A;&#x5B50;&#x5C0F;&#x4E86;&#x597D;&#x591A;&#xFF0C;&#x771F;&#x662F;&#x5F00;&#x5FC3;&#x7684;&#x4E0D;&#x884C;&#xFF1B;&#x524D;&#x4E24;&#x5929;&#x53BB;&#x4F53;&#x68C0;&#xFF0C;&#x53D1;&#x73B0;&#x957F;&#x9AD8;&#x4E86;&#x4E24;&#x5398;&#x7C73;&#xFF0C;&#x5F00;&#x5FC3;&#x4E86;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x820D;&#x53CB;&#x7A81;&#x7136;&#x5BF9;&#x6211;&#x8BF4;&#xFF0C;&#x90A3;&#x4E2A;&#x4F53;&#x68C0;&#x6CA1;&#x6709;&#x538B;&#x5934;&#x53D1;&#xFF08;&#x4EE5;&#x524D;&#x4F53;&#x68C0;&#x90FD;&#x662F;&#x6709;&#x6807;&#x5C3A;&#x538B;&#x5934;&#x53D1;&#x7684;&#xFF09;&#xFF0C;&#x987F;&#x65F6;&#xFF0C;&#x5FC3;&#x585E;&#x3002;&#x3002;&#x3002;&#x7A9D;&#x5728;&#x5B66;&#x6821;&#x51E0;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x7AEF;&#x5348;&#x548C;&#x59B9;&#x59B9;&#x53BB;&#x4EC0;&#x5239;&#x6D77;&#x6E9C;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x4E24;&#x4E2A;&#x5931;&#x604B;&#x7684;&#x4EBA;&#x624E;&#x5230;&#x60C5;&#x4FA3;&#x5806;&#x91CC;&#x53EA;&#x89C9;&#x5F97;&#x6765;&#x8FD9;&#x771F;&#x662F;&#x8111;&#x888B;&#x88AB;&#x9A74;&#x8E22;&#x4E86;&#xFF0C;&#x7A81;&#x6765;&#x7684;&#x96E8;&#x66F4;&#x662F;&#x5E94;&#x666F;&#x3002;&#x4E0D;&#x8FC7;&#x559D;&#x4E86;&#x4E00;&#x76F4;&#x6CA1;&#x559D;&#x8FC7;&#x7684;&#x9178;&#x5976;&#xFF0C;&#x53D1;&#x73B0;&#x4E86;&#x4EE5;&#x524D;&#x672A;&#x53D1;&#x73B0;&#x7684;&#x4EC0;&#x5239;&#x6D77;&#x7684;&#x7F8E;&#x4E5F;&#x8FD8;&#x662F;&#x633A;&#x597D;&#x7684;&#xFF1B;&#x4E0B;&#x5348;&#x770B;&#x4E86;&#x300A;&#x6454;&#x8DE4;&#x5427;&#xFF0C;&#x7238;&#x7238;&#x300B;&#xFF0C;&#x963F;&#x7C73;&#x5C14;&#xB7;&#x6C57;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x7537;&#x795E;&#xFF0C;&#x8BB0;&#x5F97;&#x5927;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x770B;&#x4E09;&#x50BB;&#x770B;&#x5F97;&#x6CEA;&#x5954;&#xFF08;&#x771F;&#x6CEA;&#x5954;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x6211;&#x6CEA;&#x70B9;&#x9AD8;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x611F;&#x52A8;&#x7684;&#x4E0D;&#x884C;&#x3002;&#x8BA1;&#x5212;&#x4E0B;&#x9762;&#x7EE7;&#x7EED;&#x518D;&#x5F00;&#x53D1;&#x5F00;&#x53D1;&#x65B0;&#x5267;&#xFF0C;&#x5F00;&#x5FC3;&#x3002;<br>&#x2003;&#x2003;&#x771F;&#x662F;&#x597D;&#x4E45;&#x6CA1;&#x5199;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x4E0A;&#x6B21;&#x5199;&#x8FD8;&#x662F;&#x604B;&#x7231;&#x524D;&#xFF0C;&#x8FD8;&#x662F;&#x5728;QQ&#x7A7A;&#x95F4;&#x5199;&#x7684;&#xFF0C;&#x5F80;&#x4E8B;&#x5440;&#x3002;&#x3002;&#x3002;&#x611F;&#x89C9;&#x8FD9;&#x7BC7;&#x5199;&#x7684;&#x771F;&#x662F;&#x968F;&#x610F;&#xFF0C;&#x6211;&#x5F00;&#x5FC3;&#x5C31;&#x597D;&#xFF0C;&#x53CD;&#x6B63;&#x662F;&#x6211;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x55EF;&#x3002;<br>&#x2003;&#x2003;&#x54C8;&#x54C8;&#xFF0C;&#x5728;&#x8FD9;&#x9633;&#x5149;&#x707F;&#x70C2;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#xFF0C;&#x6B63;&#x503C;&#x9633;&#x5149;&#x707F;&#x70C2;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x8FD8;&#x662F;&#x71E5;&#x8D77;&#x6765;&#x5427;&#x3002;</p></div><p class="readmore"><a href="/2017/06/03/yangguangcanlan/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2017/03/15/MilddlewareRace/">阿里巴巴中间件性能挑战赛-设计简介</a></h2><div class="post-meta">2017-03-15</div><a data-disqus-identifier="2017/03/15/MilddlewareRace/" href="/2017/03/15/MilddlewareRace/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x5148;&#x653E;&#x51E0;&#x5F20;&#x4E2D;&#x95F4;&#x4EF6;&#x6BD4;&#x8D5B;&#x65F6;&#x7684;&#x8BBE;&#x8BA1;&#x56FE;&#xFF0C;&#x6587;&#x5B57;&#x5185;&#x5BB9;&#x4F1A;&#x540E;&#x7EED;&#x8865;&#x5145;</p></div><p class="readmore"><a href="/2017/03/15/MilddlewareRace/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2017/02/26/ReadingNotes-JavaConcurrencyInPractice/">读书笔记-《Java并发编程实战》</a></h2><div class="post-meta">2017-02-26</div><a data-disqus-identifier="2017/02/26/ReadingNotes-JavaConcurrencyInPractice/" href="/2017/02/26/ReadingNotes-JavaConcurrencyInPractice/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x5BD2;&#x5047;&#x5728;&#x5BB6;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x4E86;<a href="https://www.amazon.cn/~/dp/B0077K9XHW/ref=sr_1_1?ie=UTF8&amp;qid=1488119648&amp;sr=8-1&amp;keywords=java%E5%B9%B6%E5%8F%91%E7%BC%96%E7%A8%8B%E5%AE%9E%E6%88%98" target="_blank" rel="external">&#x300A;Java&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x5B9E;&#x6218;&#x300B;&#xFF08;&#x82F1;&#x6587;&#x540D;&#xFF1A;Java Concurrency in Practice) </a>&#x4E00;&#x4E66;&#xFF0C;&#x8FC7;&#x7A0B;&#x4E2D;&#x78B0;&#x5230;&#x4E86;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x548C;&#x503C;&#x5F97;&#x6DF1;&#x7A76;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x5B9E;&#x8DF5;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x968F;&#x624B;&#x5C06;&#x4E2A;&#x4EBA;&#x7591;&#x60D1;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x8FDB;&#x884C;&#x8865;&#x5145;&#x8BF4;&#x660E;&#xFF0C;&#x6574;&#x7406;&#x5230;&#x4E86;GitHub&#x4E0A;&#x3002;</p></div><p class="readmore"><a href="/2017/02/26/ReadingNotes-JavaConcurrencyInPractice/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2017/01/06/Java-SourceCode-Sort/">Java源码阅读-DualPivotQuicksort</a></h2><div class="post-meta">2017-01-06</div><a data-disqus-identifier="2017/01/06/Java-SourceCode-Sort/" href="/2017/01/06/Java-SourceCode-Sort/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x5BF9;JDK&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x5F88;&#x597D;&#x5947;&#xFF0C;&#x62BD;&#x4E86;&#x70B9;&#x65F6;&#x95F4;&#x770B;&#x4E86;&#x4E0B;&#x6E90;&#x7801;&#xFF0C;&#x6536;&#x83B7;&#x826F;&#x591A;&#x3002;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5728;&#x4E8E;&#xFF0C;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x540C;&#x7279;&#x6027;&#xFF0C;&#x52A8;&#x6001;&#x7684;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5145;&#x5206;&#x5229;&#x7528;&#x5404;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4EE5;&#x671F;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x7EFC;&#x5408;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53EA;&#x662F;Sort&#x76F8;&#x5173;&#x7684;&#x6E90;&#x7801;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4E4B;&#x540E;&#x4F1A;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x63A2;&#x7A76;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x5185;&#x5BB9;&#x3002;</p></div><p class="readmore"><a href="/2017/01/06/Java-SourceCode-Sort/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/10/23/Docker-常用命令/">Docker 常用命令</a></h2><div class="post-meta">2016-10-23</div><a data-disqus-identifier="2016/10/23/Docker-常用命令/" href="/2016/10/23/Docker-常用命令/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x521D;&#x5B66;Docker&#xFF0C;&#x8BB0;&#x5F55;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x547D;&#x4EE4;&#x4E0E;&#x914D;&#x7F6E;&#x65B9;&#x6CD5;&#x3002;</p></div><p class="readmore"><a href="/2016/10/23/Docker-常用命令/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/10/07/利用Docker快速搭建WordPress博客/">利用Docker快速搭建WordPress博客</a></h2><div class="post-meta">2016-10-07</div><a data-disqus-identifier="2016/10/07/利用Docker快速搭建WordPress博客/" href="/2016/10/07/利用Docker快速搭建WordPress博客/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x8BFB;&#x7814;&#x4E00;&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x4E00;&#x76F4;&#x60F3;&#x7740;&#x7ED9;&#x8BFE;&#x9898;&#x7EC4;&#x91CC;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x7F51;&#x7AD9;&#xFF0C;&#x65B9;&#x4FBF;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x5206;&#x4EAB;&#x5404;&#x79CD;&#x6280;&#x672F;&#x3001;&#x4EA7;&#x54C1;&#x7ECF;&#x9A8C;&#xFF0C;&#x540C;&#x65F6;&#x56E2;&#x961F;&#x4E5F;&#x80FD;&#x6C89;&#x6DC0;&#x4E0B;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x5341;&#x4E00;&#x521A;&#x597D;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x67E5;&#x4E86;&#x67E5;&#x8D44;&#x6599;&#xFF0C;&#x7528;Docker&#x548C;WordPress&#x642D;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x7F51;&#x7AD9;&#x3002;&#x4E0B;&#x9762;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x4E00;&#x4E9B;&#x642D;&#x5EFA;&#x8FC7;&#x7A0B;&#x3002;</p></div><p class="readmore"><a href="/2016/10/07/利用Docker快速搭建WordPress博客/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/09/18/RESTful-SpringMVC-Swagger-Demo/">RESTful SpringMVC Swagger Demo</a></h2><div class="post-meta">2016-09-18</div><a data-disqus-identifier="2016/09/18/RESTful-SpringMVC-Swagger-Demo/" href="/2016/09/18/RESTful-SpringMVC-Swagger-Demo/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>SpringMVC&#x6846;&#x67B6;&#x642D;&#x5EFA; RESTful &#x98CE;&#x683C;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x793A;&#x4F8B;<br>&#x6E90;&#x7801;&#xFF1A;<a href="https://github.com/ZongWenlong/RESTful-SpringMVC-Swagger-Demo" target="_blank" rel="external">RESTful-SpringMVC-Swagger-Demo</a></p></div><p class="readmore"><a href="/2016/09/18/RESTful-SpringMVC-Swagger-Demo/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/09/03/西藏游记（六人七天）/">西藏游记（六人七天）</a></h2><div class="post-meta">2016-09-03</div><a data-disqus-identifier="2016/09/03/西藏游记（六人七天）/" href="/2016/09/03/西藏游记（六人七天）/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x897F;&#x85CF;&#xFF0C;&#x4E00;&#x4E2A;&#x795E;&#x79D8;&#x800C;&#x9065;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#x53BB;&#x8FD9;&#x4E2A;&#x79BB;&#x592A;&#x9633;&#x6700;&#x8FD1;&#x7684;&#x5730;&#x65B9;&#x770B;&#x770B;&#x3002;&#x8FD9;&#x4E2A;&#x6691;&#x5047;&#xFF0C;&#x5728;&#x5C0F;&#x4F19;&#x4F34;&#x7684;&#x76F8;&#x4E92;&#x201C;&#x903C;&#x8FEB;&#x201D;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7EC8;&#x4E8E;&#x6765;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x8BA9;&#x4EBA;&#x75F4;&#x9189;&#x7684;&#x5730;&#x65B9;&#x3002;<br>&#x2003;&#x2003;&#x5728;&#x897F;&#x85CF;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5171;&#x5446;&#x4E86;7&#x5929;&#x3002;7&#x5929;&#x91CC;&#xFF0C;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x7ECF;&#x5386;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x201C;&#x6C7D;&#x8F66;&#x65C5;&#x884C;&#x201D;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x5982;&#x6B64;&#x6E5B;&#x84DD;&#x7684;&#x5929;&#x7A7A;&#x3001;&#x6E56;&#x6C34;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x624B;&#x811A;&#x5E76;&#x7528;&#x6500;&#x722C;&#x5C0F;&#x5C71;&#x2014;&#x2014;&#x53EA;&#x4E3A;&#x79BB;&#x90A3;&#x51B0;&#x5DDD;&#x66F4;&#x8FD1;&#x4E00;&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x89C9;&#x5F97;&#x4E16;&#x754C;&#x4E0A;&#x7ADF;&#x7136;&#x80FD;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5982;&#x6B64;&#x8BA9;&#x4EBA;&#x96BE;&#x4EE5;&#x5FD8;&#x6000;&#xFF0C;&#x671F;&#x5F85;&#x7740;&#x4E0E;&#x5979;&#x7684;&#x518D;&#x6B21;&#x76F8;&#x9047;&#x3002; </p></div><p class="readmore"><a href="/2016/09/03/西藏游记（六人七天）/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/06/01/并发编程(1)-从单例模式说起/">并发编程(1)-单例模式和volatile</a></h2><div class="post-meta">2016-06-01</div><a data-disqus-identifier="2016/06/01/并发编程(1)-从单例模式说起/" href="/2016/06/01/并发编程(1)-从单例模式说起/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x4E4B;&#x524D;&#x5728;&#x627E;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x88AB;N&#x6B21;&#x95EE;&#x8FC7;&#xFF0C;&#x4F60;&#x7528;&#x8FC7;&#x4EC0;&#x4E48;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E48;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x77E5;&#x9053;&#x6709;&#x4EC0;&#x4E48;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E48;&#xFF1F;&#x6BCF;&#x6B21;&#x6211;&#x90FD;&#x53EA;&#x4F1A;&#x7F9E;&#x6127;&#x7684;&#x8BF4;&#xFF0C;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x5C31;&#x4F1A;&#x8BF4;&#xFF0C;&#x90A3;&#x5C31;&#x5199;&#x4E00;&#x4E0B;&#x5427;&#x3002;&#x7136;&#x540E;&#x6211;&#x5C31;&#x628A;&#x76F4;&#x63A5;&#x80CC;&#x8BF5;&#x8FC7;&#x5F97;&#x6A21;&#x677F;&#x7684;&#x5199;&#x4E86;&#x51FA;&#x6765;&#x3002;&#x5F53;&#x65F6;&#x7F9E;&#x6127;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6211;&#x53EA;&#x4F1A;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x2014;&#x2014;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;&#x5173;&#x4E8E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FD9;&#x4E2A;&#x5751;&#x4F1A;&#x5728;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x586B;&#x8865;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x6211;&#x624D;&#x610F;&#x8BC6;&#x5230;&#x8FD8;&#x6709;&#x4E2A;&#x5730;&#x65B9;&#x66F4;&#x5E94;&#x8BE5;&#x611F;&#x5230;&#x7F9E;&#x6127;&#x2014;&#x2014;&#x552F;&#x4E00;&#x770B;&#x8FC7;&#x7684;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x8FD8;&#x5199;&#x7684;&#x6709;&#x95EE;&#x9898;&#x3002;</p></div><p class="readmore"><a href="/2016/06/01/并发编程(1)-从单例模式说起/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2016/05/25/Little-Tips/">Little Tips（持续更新）</a></h2><div class="post-meta">2016-05-25</div><a data-disqus-identifier="2016/05/25/Little-Tips/" href="/2016/05/25/Little-Tips/#disqus_thread" class="disqus-comment-count"></a><div class="post-content"><p>&#x2003;&#x2003;&#x6536;&#x5F55;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x5C0F;&#x6280;&#x5DE7;</p></div><p class="readmore"><a href="/2016/05/25/Little-Tips/">阅读更多</a></p></div><nav class="page-navigator"><span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="extend next" rel="next" href="/page/2/">下一页</a></nav><script id="dsq-count-scr" src="//http-zongwenlong-github-io.disqus.com/count.js" async></script></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="search-form"><input id="local-search-input" placeholder="Search" type="text" name="q" results="0"/><div id="local-search-result"></div></div></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Life/">Life</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Technology/">Technology</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/并发/" style="font-size: 15px;">并发</a> <a href="/tags/设计模式/" style="font-size: 15px;">设计模式</a> <a href="/tags/源码阅读/" style="font-size: 15px;">源码阅读</a> <a href="/tags/Sort/" style="font-size: 15px;">Sort</a> <a href="/tags/Docker/" style="font-size: 15px;">Docker</a> <a href="/tags/阳光灿烂/" style="font-size: 15px;">阳光灿烂</a> <a href="/tags/RESTful/" style="font-size: 15px;">RESTful</a> <a href="/tags/Hexo/" style="font-size: 15px;">Hexo</a> <a href="/tags/算法/" style="font-size: 15px;">算法</a> <a href="/tags/动态规划/" style="font-size: 15px;">动态规划</a> <a href="/tags/Java/" style="font-size: 15px;">Java</a> <a href="/tags/多线程/" style="font-size: 15px;">多线程</a> <a href="/tags/Cache/" style="font-size: 15px;">Cache</a> <a href="/tags/分布式/" style="font-size: 15px;">分布式</a> <a href="/tags/西藏/" style="font-size: 15px;">西藏</a> <a href="/tags/旅游/" style="font-size: 15px;">旅游</a> <a href="/tags/WordPress/" style="font-size: 15px;">WordPress</a> <a href="/tags/容器/" style="font-size: 15px;">容器</a> <a href="/tags/团队分享/" style="font-size: 15px;">团队分享</a> <a href="/tags/图搜索/" style="font-size: 15px;">图搜索</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2017/06/03/yangguangcanlan/">在这阳光灿烂的日子里</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/03/15/MilddlewareRace/">阿里巴巴中间件性能挑战赛-设计简介</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/02/26/ReadingNotes-JavaConcurrencyInPractice/">读书笔记-《Java并发编程实战》</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/01/06/Java-SourceCode-Sort/">Java源码阅读-DualPivotQuicksort</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/10/23/Docker-常用命令/">Docker 常用命令</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/10/07/利用Docker快速搭建WordPress博客/">利用Docker快速搭建WordPress博客</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/18/RESTful-SpringMVC-Swagger-Demo/">RESTful SpringMVC Swagger Demo</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/03/西藏游记（六人七天）/">西藏游记（六人七天）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/01/并发编程(1)-从单例模式说起/">并发编程(1)-单例模式和volatile</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/25/Little-Tips/">Little Tips（持续更新）</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-comment-o"> 最近评论</i></div><script type="text/javascript" src="//http-zongwenlong-github-io.disqus.com/recent_comments_widget.js?num_items=5&amp;hide_avatars=1&amp;avatar_size=32&amp;excerpt_length=20&amp;hide_mods=1"></script></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://github.com/" title="GitHub" target="_blank">GitHub</a><ul></ul><a href="https://www.haomwei.com/technology/maupassant-hexo.html" title="Maupassant" target="_blank">Maupassant</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">All is well.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script type="text/javascript" src="/js/search.js?v=0.0.0"></script><script>var search_path = 'search.xml';
if (search_path.length == 0) {
   search_path = 'search.xml';
}
var path = '/' + search_path;
searchFunc(path, 'local-search-input', 'local-search-result');
</script><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-77720589-1','auto');ga('send','pageview');
</script><script>var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?28aa9a092a9c1d26ba2a3b5d6f2c7c60";
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
  })();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>